src/cf/Documents/ЗаявкаНаПродажуЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаявкаНаПродажуЦБ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеДСНаСчете</xr:Item>
				<xr:Item>AccumulationRegister.КомиссияБиржи</xr:Item>
				<xr:Item>AccumulationRegister.Прибыль</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеЦБ</xr:Item>
				<xr:Item>AccumulationRegister.КомиссияБрокера</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БрокерскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Инструмент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЛотов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦБВЛоте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииБрокера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомиссияБиржи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииБиржи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ЗаявкаНаПродажуЦБ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ИнструментыИнструментПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИнструментПриИзменении(Элемент)  
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.КоличествоЦБВЛоте = ПолучитьКоличествоЦБВЛоте(ТекСтр.Инструмент);
	ИнструментыИнструментПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЦБВЛоте(ЦБ)
	
	Возврат ЦБ.КоличествоЦБВЛоте; 	
	
КонецФункции // ПолучитьКоличествоЦБВЛоте()

&НаКлиенте
Процедура ИнструментыКоличествоЛотовПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.КоличествоЦБ = ТекСтр.КоличествоЛотов  * ТекСтр.КоличествоЦБВЛоте;  
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыЦенаПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.Сумма = ТекСтр.Цена * ТекСтр.КоличествоЦБ;  
	ИнструментыСуммаПриИзменении(Элемент); 
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда  
		
		ЗначениеКомиссий = Новый Структура;
		ЗначениеКомиссиийНаСервере(ЗначениеКомиссий);
		Элемент.ТекущиеДанные.КомиссияБрокера = ЗначениеКомиссий.КомиссияБрокера;
		Элемент.ТекущиеДанные.КомиссияБиржи = ЗначениеКомиссий.КомиссияБиржи;
		
	КонецЕсли;  	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗначениеКомиссиийНаСервере(ЗначениеКомиссиий)

	ЗначениеКомиссиий = ОбщийКэшируемыйМодуль.ПолучитьКомиссииБрокраИБиржиПоСчету(Объект.БрокерскийСчет);	

КонецПроцедуры

&НаКлиенте
Процедура ИнструментыСуммаПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссииБрокера = ТекСтр.Сумма * ТекСтр.КомиссияБрокера / 100;
	ТекСтр.СуммаКомиссииБиржи   = ТекСтр.Сумма * ТекСтр.КомиссияБиржи /100;

КонецПроцедуры

&НаКлиенте
Процедура ИнструментыСуммаКомиссииБрокераПриИзменении(Элемент)
	
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзмененииСуммыКомиссиий(Элемент)

	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссии = ТекСтр.СуммаКомиссииБрокера  + ТекСтр. СуммаКомиссииБиржи;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыСуммаКомиссииБиржиПриИзменении(Элемент)
	
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыКомиссияБрокераПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссииБрокера = ТекСтр.Сумма * ТекСтр.КомиссияБрокера / 100;  
	ПриИзмененииСуммыКомиссиий(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыКомиссияБиржыПриИзменении(Элемент)
	
	ТекСтр = Элементы.Инструменты.ТекущиеДанные;
	ТекСтр.СуммаКомиссииБиржи   = ТекСтр.Сумма * ТекСтр.КомиссияБиржи /100;  
	ПриИзмененииСуммыКомиссиий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
КонецПроцедуры
